app/views/dashboard/admin/items/edit.html.erb

SELECT `cates`.* FROM `cates`
---

	Category <%= f.select :cate_id , Cate.all.map{|c|[c.name , c.id]} %><br/>