app/controllers/dashboard/admin/items_controller.rb

	def index
		@items = @paginate = Item.includes(:cate).paginate(:page => params[:page])
---
SELECT  `items`.* FROM `items` ORDER BY id DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `items`

  	def edit
  		@item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

	def update
		@item = Item.find(params[:id])
		@item.update(item_params)
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `cover_file_name` = 'shirt.jpeg', `cover_content_type` = 'image/jpeg', `cover_file_size` = 27893, `cover_updated_at` = '2016-10-17 20:06:26', `updated_at` = '2016-10-17 20:06:28' WHERE `items`.`id` = 100