app/controllers/items_controller.rb

	def index
		@items = @paginate =Item.paginate(:page => params[:page])
---
SELECT  `items`.* FROM `items` ORDER BY id DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `items`

	def show
		@item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 100 LIMIT 1