app/controllers/items_controller.rb

SELECT  `items`.* FROM `items` WHERE `items`.`id` = 100 ORDER BY `items`.`id` ASC LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])