app/controllers/statics_controller.rb

	def index
		@items = @paginate = Item.paginate(:page => params[:page])
---
SELECT COUNT(*) FROM `items`